podonoghue/usbdm-eclipse-makefiles-build/PackageFiles/Stationery/Device.SVD/Internal/peripherals/NVIC_MKW41Z4.svd.xml
            <register>
               <name>IPR0</name>
               <description>Interrupt Priority Register 0</description>
               <addressOffset>0x300</addressOffset>
               <fields>
                  <field>
                     <name>PRI_0</name>
                     <description>DMA_Ch0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_1</name>
                     <description>DMA_Ch1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_2</name>
                     <description>DMA_Ch2</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_3</name>
                     <description>DMA_Ch3</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR1</name>
               <description>Interrupt Priority Register 1</description>
               <addressOffset>0x304</addressOffset>
               <fields>
                  <field>
                     <name>PRI_4</name>
                     <description>MCM_Reserved</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_5</name>
                     <description>FTF</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_6</name>
                     <description>PMC_DCDC</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_7</name>
                     <description>LLWU</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR2</name>
               <description>Interrupt Priority Register 2</description>
               <addressOffset>0x308</addressOffset>
               <fields>
                  <field>
                     <name>PRI_8</name>
                     <description>I2C0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_9</name>
                     <description>I2C1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_10</name>
                     <description>SPI0</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_11</name>
                     <description>TSI</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR3</name>
               <description>Interrupt Priority Register 3</description>
               <addressOffset>0x30C</addressOffset>
               <fields>
                  <field>
                     <name>PRI_12</name>
                     <description>LPUART0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_13</name>
                     <description>TRNG0AN</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_14</name>
                     <description>CMT</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_15</name>
                     <description>ADC0</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR4</name>
               <description>Interrupt Priority Register 4</description>
               <addressOffset>0x310</addressOffset>
               <fields>
                  <field>
                     <name>PRI_16</name>
                     <description>CMP0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_17</name>
                     <description>TPM0</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_18</name>
                     <description>TPM1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_19</name>
                     <description>TPM2</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR5</name>
               <description>Interrupt Priority Register 5</description>
               <addressOffset>0x314</addressOffset>
               <fields>
                  <field>
                     <name>PRI_20</name>
                     <description>RTC_Alarm</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_21</name>
                     <description>RTC_Seconds</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_22</name>
                     <description>PIT</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_23</name>
                     <description>LTC0</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR6</name>
               <description>Interrupt Priority Register 6</description>
               <addressOffset>0x318</addressOffset>
               <fields>
                  <field>
                     <name>PRI_24</name>
                     <description>Radio_Int0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_25</name>
                     <description>DAC0</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_26</name>
                     <description>Radio_Int1</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_27</name>
                     <description>MCG</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>IPR7</name>
               <description>Interrupt Priority Register 7</description>
               <addressOffset>0x31C</addressOffset>
               <fields>
                  <field>
                     <name>PRI_28</name>
                     <description>LPTMR0</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_29</name>
                     <description>SPI1</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_30</name>
                     <description>Port_A</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
                  <field>
                     <name>PRI_31</name>
                     <description>PORTA_PORTC</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                  </field>
               </fields>
            </register>
         </registers>
      </peripheral>
